while True:
    list = {'悟空' : {'数学' : 91, '语文' : 94, '英语' : 88}, 
            '诺依' : {'数学' : 95, '语文' : 89, '英语' : 98}, 
            '小八' : {'数学' : 59, '语文' : 54, '英语' : 65}}
    
    print('请输入名字，如要退出请按q')
    
    name = input('请输入名字：')

    print('****************************************************************')

    if name in list:
        for i,u in list[name].items():
            print(i,u)
    
    elif name == 'q':
        print('您已退出')
        break

    else:
        print('抱歉您名字输入错误')

    print('***************************************************************')